----------------------------------------------------------------------------------------------------
LINQ - Language Itegrated Query.
Допускает запросы к локальным коллекциям и к удалённым источникам данных.
Средства:
- неявно типизированные локальные переменные
- анонимные типы
- инициализаторы объектов
- лямбда-выражения
- расширяющие методы
- выражения запросов
- деревья выражений
- автоматические свойства
- частичные методы
----------------------------------------------------------------------------------------------------
